# Proyecto Movies. Creación de un Date Base.

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')
import src.cleaning_movies as cm

Requirement already satisfied: ipython in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (7.34.0)
Requirement already satisfied: pygments in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (2.13.0)
Requirement already satisfied: pexpect>4.3 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (4.8.0)
Requirement already satisfied: traitlets>=4.2 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (5.4.0)
Requirement already satisfied: jedi>=0.16 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (0.18.1)
Requirement already satisfied: backcall in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (0.2.0)
Requirement already satisfied: appnope in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (0.1.3)
Requirement already satisfied: matplotlib-inline in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (0.1.6)
Requirement already satisfied: setuptools>=18.5 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (63.4.1)
Requirement already satisfied: decorator in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (5.1.1)
Requirement already satisfied: pickleshare in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from ipython) (3.0.31)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from jedi>=0.16->ipython) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from pexpect>4.3->ipython) (0.7.0)
Requirement already satisfied: wcwidth in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython) (0.2.5)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (0.12.1)
Requirement already satisfied: numpy>=1.17 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from seaborn) (1.21.6)
Requirement already satisfied: typing_extensions in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from seaborn) (4.4.0)
Requirement already satisfied: matplotlib!=3.6.1,>=3.1 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from seaborn) (3.5.3)
Requirement already satisfied: pandas>=0.25 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from seaborn) (1.3.5)
Requirement already satisfied: kiwisolver>=1.0.1 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (1.4.4)
Requirement already satisfied: fonttools>=4.22.0 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (4.38.0)
Requirement already satisfied: pillow>=6.2.0 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (9.2.0)
Requirement already satisfied: packaging>=20.0 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (21.3)
Requirement already satisfied: cycler>=0.10 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (0.11.0)
Requirement already satisfied: pyparsing>=2.2.1 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from matplotlib!=3.6.1,>=3.1->seaborn) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from pandas>=0.25->seaborn) (2022.4)
Requirement already satisfied: six>=1.5 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.1->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

Se realiza la importación de todos los archvos csv que van a formar la base de datos para transformarlos a DF y limpiarlos.

In [2]:
#Importación de los archivo a df a originales.

actor_ori=pd.read_csv('actor.csv')
category_ori=pd.read_csv('category.csv')
film_ori=pd.read_csv('film.csv')
inventory_ori=pd.read_csv('inventory.csv')
language_ori=pd.read_csv('language.csv')
old_HDD_ori=pd.read_csv('old_HDD.csv')
rental_ori=pd.read_csv('rental.csv')

#Y realizamos la copia con la que se va a trabajar de cada uno.

actor=actor_ori.copy()
category=category_ori.copy()
film=film_ori.copy()
inventory=inventory_ori.copy()
language=language_ori.copy()
old_HDD=old_HDD_ori.copy()
rental=rental_ori.copy()

## Limpieza de datos:

### 1. Limpieza de actor.csv.

In [3]:
#Se comprueba la solided de los datos.

actor.head()

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2006-02-15 04:34:33
1         2       NICK      WAHLBERG  2006-02-15 04:34:33
2         3         ED         CHASE  2006-02-15 04:34:33
3         4   JENNIFER         DAVIS  2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA  2006-02-15 04:34:33

In [4]:
actor.shape

(200, 4)

In [5]:
#Verificamos si existen nulos en alguna columna y verificamos que no.

actor.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 41.0 KB

In [6]:
#La única tranformación que se decide hacer en la tabla actor es separar la fecha de la hora de la columna last_update.

descarga=actor['last_update'].tolist()

actor['last_update_date'] = ''
actor['last_update_time'] = ''

def separar_fecha_hora1(descarga):
    
    for i in range(0, len(descarga)):
        
        actor['last_update_date'][i] = descarga[i].split()[0]
        actor['last_update_time'][i] = descarga[i].split()[1]

separar_fecha_hora1(descarga)

In [7]:
actor = actor.drop(columns=['last_update'])

In [8]:
# Se concatenan las columnas de first_name y last_name para que solo aparezca una con el nombre completo:

actor['full_name'] = actor.first_name.str.cat(actor.last_name, sep=' ')

In [9]:
#Se verifica que si existe algún actor duplicado.

len(actor.full_name.unique())

199

In [10]:
#Se eliminan las columas que se han concatenado.

actor = actor.drop(columns=['first_name','last_name'])

In [11]:
#Se elimina la fila en la que el nombre del actor está duplicado.

actor = actor.drop_duplicates(subset=['full_name'])

In [12]:
actor.head()

   actor_id last_update_date last_update_time            full_name
0         1       2006-02-15         04:34:33     PENELOPE GUINESS
1         2       2006-02-15         04:34:33        NICK WAHLBERG
2         3       2006-02-15         04:34:33             ED CHASE
3         4       2006-02-15         04:34:33       JENNIFER DAVIS
4         5       2006-02-15         04:34:33  JOHNNY LOLLOBRIGIDA

### 2. Limpieza de category.csv.

In [13]:
category.head()

   category_id       name          last_update
0            1     Action  2006-02-15 04:46:27
1            2  Animation  2006-02-15 04:46:27
2            3   Children  2006-02-15 04:46:27
3            4   Classics  2006-02-15 04:46:27
4            5     Comedy  2006-02-15 04:46:27

In [14]:
#De igual manera que en la columna anterior se comrpueba que no hay nulos:

category.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 2.4 KB

In [15]:
category.name.unique()

array(['Action', 'Animation', 'Children', 'Classics', 'Comedy',
       'Documentary', 'Drama', 'Family', 'Foreign', 'Games', 'Horror',
       'Music', 'New', 'Sci-Fi', 'Sports', 'Travel'], dtype=object)

In [16]:
#De igual manera se separa la culumna de fecha y hora:
category['last_update_date'] = ''
category['last_update_time'] = ''

categoria=category['last_update'].tolist()

def separar_fecha_hora2(categoria):
    
    for i in range(0, len(categoria)):
        
        category['last_update_date'][i] = categoria[i].split()[0]
        category['last_update_time'][i] = categoria[i].split()[1]

separar_fecha_hora2(categoria)

In [17]:
category = category.drop(columns=['last_update'])

In [18]:
#Se verifican duplicados:

In [19]:
category.drop_duplicates().shape==category.shape

True

In [20]:
category.head()

   category_id       name last_update_date last_update_time
0            1     Action       2006-02-15         04:46:27
1            2  Animation       2006-02-15         04:46:27
2            3   Children       2006-02-15         04:46:27
3            4   Classics       2006-02-15         04:46:27
4            5     Comedy       2006-02-15         04:46:27

### 3. Limpieza de film.csv.

In [21]:
#Se comprueba la solided de los datos.

film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,NaN,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,NaN,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,NaN,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15 05:03:42

In [22]:
#Se comprueban nulos:
film.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 495.3 KB

In [23]:
#Se verifica que la columna original_language_id tiene todos sus valores nulos, por lo que se toma la decisión de eliminarla.

film = film.drop(columns=['original_language_id'])

In [24]:
#Se verifican duplicados:

film.drop_duplicates().shape==film.shape

True

In [25]:
#De igual manera se separa la culumna de fecha y hora:

film['last_update_date'] = ''
film['last_update_time'] = ''

pelicula=film['last_update'].tolist()

def separar_fecha_hora3(pelicula):
    
    for i in range(0, len(pelicula)):
        
        film['last_update_date'][i] = pelicula[i].split()[0]
        film['last_update_time'][i] = pelicula[i].split()[1]

separar_fecha_hora3(pelicula)

In [26]:
film = film.drop(columns=['last_update'])

In [27]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update_date,last_update_time
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15,05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15,05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2006-02-15,05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2006-02-15,05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,2006-02-15,05:03:42

In [28]:
min(film['rental_rate'])

0.99

In [29]:
film.special_features.unique()

array(['Deleted Scenes,Behind the Scenes', 'Trailers,Deleted Scenes',
       'Commentaries,Behind the Scenes', 'Deleted Scenes', 'Trailers',
       'Commentaries,Deleted Scenes',
       'Trailers,Deleted Scenes,Behind the Scenes',
       'Trailers,Commentaries,Behind the Scenes', 'Trailers,Commentaries',
       'Trailers,Behind the Scenes',
       'Commentaries,Deleted Scenes,Behind the Scenes',
       'Trailers,Commentaries,Deleted Scenes',
       'Trailers,Commentaries,Deleted Scenes,Behind the Scenes',
       'Behind the Scenes', 'Commentaries'], dtype=object)

In [30]:
film.columns

Index(['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features', 'last_update_date', 'last_update_time'],
      dtype='object')

In [31]:
film=film[['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'special_features','special_features','special_features','special_features',
        'last_update_date', 'last_update_time']].copy()

In [32]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,special_features,special_features,special_features,last_update_date,last_update_time
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes","Deleted Scenes,Behind the Scenes","Deleted Scenes,Behind the Scenes","Deleted Scenes,Behind the Scenes",2006-02-15,05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes","Trailers,Deleted Scenes","Trailers,Deleted Scenes","Trailers,Deleted Scenes",2006-02-15,05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes","Trailers,Deleted Scenes","Trailers,Deleted Scenes","Trailers,Deleted Scenes",2006-02-15,05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes","Commentaries,Behind the Scenes","Commentaries,Behind the Scenes","Commentaries,Behind the Scenes",2006-02-15,05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,Deleted Scenes,Deleted Scenes,Deleted Scenes,2006-02-15,05:03:42

In [33]:
film.columns=['film_id', 'title', 'description', 'release_year', 'language_id',
       'rental_duration', 'rental_rate', 'length', 'replacement_cost',
       'rating', 'behind_the_scenes','commentaries','deleted_scenes','trailers',
        'last_update_date', 'last_update_time']
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,behind_the_scenes,commentaries,deleted_scenes,trailers,last_update_date,last_update_time
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes","Deleted Scenes,Behind the Scenes","Deleted Scenes,Behind the Scenes","Deleted Scenes,Behind the Scenes",2006-02-15,05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,"Trailers,Deleted Scenes","Trailers,Deleted Scenes","Trailers,Deleted Scenes","Trailers,Deleted Scenes",2006-02-15,05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes","Trailers,Deleted Scenes","Trailers,Deleted Scenes","Trailers,Deleted Scenes",2006-02-15,05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes","Commentaries,Behind the Scenes","Commentaries,Behind the Scenes","Commentaries,Behind the Scenes",2006-02-15,05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,Deleted Scenes,Deleted Scenes,Deleted Scenes,Deleted Scenes,2006-02-15,05:03:42

In [34]:
film.deleted_scenes=film.deleted_scenes.apply(cm.deleted)

In [35]:
film.behind_the_scenes=film.behind_the_scenes.apply(cm.behind)

In [36]:
film.commentaries=film.commentaries.apply(cm.comentarios)

In [37]:
film.trailers=film.trailers.apply(cm.trailer)

In [38]:
film.head()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,behind_the_scenes,commentaries,deleted_scenes,trailers,last_update_date,last_update_time
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,Yes,No,Yes,No,2006-02-15,05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,3,4.99,48,12.99,G,No,No,Yes,Yes,2006-02-15,05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,7,2.99,50,18.99,NC-17,No,No,Yes,Yes,2006-02-15,05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,5,2.99,117,26.99,G,Yes,Yes,No,No,2006-02-15,05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,6,2.99,130,22.99,G,No,No,Yes,No,2006-02-15,05:03:42

### 4. Limpieza de inventory.csv.

In [39]:
#Se observa la solided de los datos.

inventory.head()

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17

In [40]:
#Se comprueban nulos:

inventory.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [41]:
#Se verifica que no existen duplicados:

inventory.drop_duplicates().shape==inventory.shape

True

In [42]:
#De igual manera se separa la culumna de fecha y hora:

inventory['last_update_date'] = ''
inventory['last_update_time'] = ''

inventario=inventory['last_update'].tolist()

def separar_fecha_hora4(pelicula):
    
    for i in range(0, len(pelicula)):
        
        inventory['last_update_date'][i] = inventario[i].split()[0]
        inventory['last_update_time'][i] = inventario[i].split()[1]

separar_fecha_hora4(inventario)

In [43]:
inventory = inventory.drop(columns=['last_update'])

In [44]:
inventory.head()

   inventory_id  film_id  store_id last_update_date last_update_time
0             1        1         1       2006-02-15         05:09:17
1             2        1         1       2006-02-15         05:09:17
2             3        1         1       2006-02-15         05:09:17
3             4        1         1       2006-02-15         05:09:17
4             5        1         2       2006-02-15         05:09:17

### 5. Limpieza de language.csv.

In [45]:
#Se observa la solided de los datos.

language.head()

   language_id      name          last_update
0            1   English  2006-02-15 05:02:19
1            2   Italian  2006-02-15 05:02:19
2            3  Japanese  2006-02-15 05:02:19
3            4  Mandarin  2006-02-15 05:02:19
4            5    French  2006-02-15 05:02:19

In [46]:
#Se comprueban nulos:

language.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 1016.0 bytes

In [47]:
#Se verifica que no existen duplicados:

language.drop_duplicates().shape==language.shape

True

In [48]:
#Se separa la culumna de fecha y hora:

language['last_update_date'] = ''
language['last_update_time'] = ''

idioma=language['last_update'].tolist()

def separar_fecha_hora5(idioma):
    
    for i in range(0, len(idioma)):
        
        language['last_update_date'][i] = idioma[i].split()[0]
        language['last_update_time'][i] = idioma[i].split()[1]

separar_fecha_hora5(idioma)

In [49]:
language = language.drop(columns=['last_update'])

In [50]:
language

   language_id      name last_update_date last_update_time
0            1   English       2006-02-15         05:02:19
1            2   Italian       2006-02-15         05:02:19
2            3  Japanese       2006-02-15         05:02:19
3            4  Mandarin       2006-02-15         05:02:19
4            5    French       2006-02-15         05:02:19
5            6    German       2006-02-15         05:02:19

### 6. Limpieza de old_HDD.csv.

In [51]:
#Se observa la solided de los datos.

old_HDD.head()

  first_name last_name                  title  release_year  category_id
0   PENELOPE   GUINESS       ACADEMY DINOSAUR          2006            6
1   PENELOPE   GUINESS   ANACONDA CONFESSIONS          2006            2
2   PENELOPE   GUINESS            ANGELS LIFE          2006           13
3   PENELOPE   GUINESS  BULWORTH COMMANDMENTS          2006           10
4   PENELOPE   GUINESS          CHEAPER CLYDE          2006           14

In [52]:
#Se comprueban nulos:

old_HDD.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 207.6 KB

In [53]:
#Se verifica que no existen duplicados:

old_HDD.drop_duplicates().shape==old_HDD.shape

True

In [54]:
# Se concatenan las columnas de first_name y last_name para que solo aparezca una con el nombre completo:

old_HDD['full_name'] = old_HDD.first_name.str.cat(old_HDD.last_name, sep=' ')

In [55]:
old_HDD = old_HDD.drop(columns=['first_name','last_name'])

In [56]:
old_HDD.head()

                   title  release_year  category_id         full_name
0       ACADEMY DINOSAUR          2006            6  PENELOPE GUINESS
1   ANACONDA CONFESSIONS          2006            2  PENELOPE GUINESS
2            ANGELS LIFE          2006           13  PENELOPE GUINESS
3  BULWORTH COMMANDMENTS          2006           10  PENELOPE GUINESS
4          CHEAPER CLYDE          2006           14  PENELOPE GUINESS

### 7. Limpieza de rental.csv.

In [57]:
#Se observa la solided de los datos.

rental.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [58]:
#Se comprueban nulos:

rental.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 254.0 KB

In [59]:
#Se verifica que no existen duplicados:

rental.drop_duplicates().shape==rental.shape

True

In [60]:
#Se separa la culumna de fecha y hora:

rental['rental_day'] = ''
rental['rental_time'] = ''

alquiler=rental['rental_date'].tolist()

def separar_fecha_hora6(alquiler):
    
    for i in range(0, len(alquiler)):
        
        rental['rental_day'][i] = alquiler[i].split()[0]
        rental['rental_time'][i] = alquiler[i].split()[1]

separar_fecha_hora6(alquiler)

In [61]:
rental = rental.drop(columns=['rental_date'])

In [62]:
rental.head()

,rental_id,inventory_id,customer_id,return_date,staff_id,last_update,rental_day,rental_time
0,1,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005-05-24,22:53:30
1,2,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005-05-24,22:54:33
2,3,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,2005-05-24,23:03:39
3,4,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,2005-05-24,23:04:41
4,5,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,2005-05-24,23:05:21

In [63]:
rental['return_day'] = ''
rental['return_time'] = ''

devolucion=rental['return_date'].tolist()

def separar_fecha_hora7(devolucion):
    
    for i in range(0, len(devolucion)):
        
        rental['return_day'][i] = devolucion[i].split()[0]
        rental['return_time'][i] = devolucion[i].split()[1]

separar_fecha_hora7(devolucion)

In [64]:
rental = rental.drop(columns=['return_date'])

In [65]:
rental['last_update_date'] = ''
rental['last_update_time'] = ''

ultimoalquiler=rental['last_update'].tolist()

def separar_fecha_hora8(ultimoalquiler):
    
    for i in range(0, len(ultimoalquiler)):
        
        rental['last_update_date'][i] = ultimoalquiler[i].split()[0]
        rental['last_update_time'][i] = ultimoalquiler[i].split()[1]

separar_fecha_hora8(ultimoalquiler)

In [66]:
rental = rental.drop(columns=['last_update'])

In [67]:
rental.head()

,rental_id,inventory_id,customer_id,staff_id,rental_day,rental_time,return_day,return_time,last_update_date,last_update_time
0,1,367,130,1,2005-05-24,22:53:30,2005-05-26,22:04:30,2006-02-15,21:30:53
1,2,1525,459,1,2005-05-24,22:54:33,2005-05-28,19:40:33,2006-02-15,21:30:53
2,3,1711,408,1,2005-05-24,23:03:39,2005-06-01,22:12:39,2006-02-15,21:30:53
3,4,2452,333,2,2005-05-24,23:04:41,2005-06-03,01:43:41,2006-02-15,21:30:53
4,5,2079,222,1,2005-05-24,23:05:21,2005-06-02,04:33:21,2006-02-15,21:30:53

## Creación de la base de datos:

In [68]:
%pip install mysql-connector-python
%pip install SQLAlchemy
%pip install pymysql
import mysql.connector as conn
from sqlalchemy import create_engine

Requirement already satisfied: mysql-connector-python in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (8.0.31)
Requirement already satisfied: protobuf<=3.20.1,>=3.11.0 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from mysql-connector-python) (3.20.1)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: SQLAlchemy in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (1.4.42)
Requirement already satisfied: importlib-metadata in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from SQLAlchemy) (5.0.0)
Requirement already satisfied: greenlet!=0.4.17 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from SQLAlchemy) (2.0.0.post0)
Requirement already satisfied: typing-extensions>=3.6.4 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from importlib-metadata->SQLAlchemy) (4.4.0)
Requirement already satisfied: zipp>=0.5 in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (from importlib-metadata->SQLAlchemy) (3.9.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pymysql in /Users/anachaparrohernandez/opt/anaconda3/envs/clase/lib/python3.7/site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [69]:
#Se crea la base de datos Date Base.

str_conn='mysql+pymysql://root:password@localhost:3306'

cursor=create_engine(str_conn)


cursor.execute('drop database if exists cinema;')

cursor.execute('create database cinema;')

In [70]:
str_conn='mysql+pymysql://root:password@localhost:3306/cinema'

cursor=create_engine(str_conn)

In [71]:
actor.to_sql(name='actor', con=cursor, if_exists='append', index=False)

In [72]:
category.to_sql(name='category', con=cursor, if_exists='append', index=False)

In [73]:
film.to_sql(name='film', con=cursor, if_exists='append', index=False)

In [74]:
inventory.to_sql(name='inventory', con=cursor, if_exists='append', index=False)

In [75]:
language.to_sql(name='language', con=cursor, if_exists='append', index=False)

In [76]:
old_HDD.to_sql(name='old_HDD', con=cursor, if_exists='append', index=False)

In [77]:
rental.to_sql(name='rental', con=cursor, if_exists='append', index=False)